// Task 10
// Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0,
// 15.5, 24.5, -21.0, 32.5. Объединить данные значения в группы с шагом в 10
// градусов. Последовательность в подмножноствах не важна.

// Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

package main

import "fmt"

func main() {
	t := []float64{-25.4, -27.0, 13.0, 5.2, 1.2, 0.5, -8.7, 19.0, 15.5, -16.7, 24.5, -21.0, 32.5}
	fmt.Println(groupTemperatures(t))
}

func groupTemperatures(t []float64) map[int][]float64 {
	m := map[int][]float64{}
	for _, v := range t {
		k := int(v/10) * 10
		m[k] = append(m[k], v)
	}

	return m
}
